{
    "main": {
      "name": "Vijaykumar R Pai",
      "occupation": "Associate Consultant (AI, Topaz CoE) @ Infosys | Infosys AI Ambassador (AI First & AI Tribe) | Automobile and ML/AI Enthusiast",
      "description": "I am an ML/AI Enthusiast with a total of 4+ years of experience in Web Development & Data Analytics/ML",
      "image": "profilepic.jpg",
      "bio": "I am a Gen AI Developer, Automobile and ML/AI Enthusiast, Foodie, Wanderlust and Gamer. Ask me about Technologies, Automobiles, Places to travel, Gaming and various Food Delicacies. My area of expertise include : Data Science/ML/AI, IoT and Cloud Computing.",
      "contactmessage": "Feel free to contact me",
      "email": "vijaykumarrpai@gmail.com",
      "phone": "+91-8861372156",
      "address":{
        "street": "Electronic City",
        "city": "Bangalore",
        "state": "Karnataka",
        "zip":  "560100"
      },
      "website": "",
      "resumedownload": "https://drive.google.com/file/d/1jfete03-Wr0oL2nRegkSPYyvJMu8kkHr/view?usp=sharing",
      "social":[
        {
          "name": "facebook",
          "url": "https://www.facebook.com/vijaykumarr.pai/",
          "className": "fa fa-facebook"
        },
        {
          "name": "twitter",
          "url": "https://twitter.com/Vijaykumarrpai",
          "className": "fa fa-twitter"
        },
        {
          "name": "linkedin",
          "url": "https://www.linkedin.com/in/vijaykumarrpai/",
          "className": "fa fa-linkedin"
        },
        {
          "name": "instagram",
          "url": "https://www.instagram.com/techie_turbo_vijay/",
          "className": "fa fa-instagram"
        },
        {
          "name": "github",
          "url": "https://github.com/vijaykumarrpai",
          "className": "fa fa-github"
        }
      ]
    },
    "resume":{
      "skillmessage": "Some of my skills which I am fond of",
      "education":[
        {
          "school": "Indian Institute of Management, Kozhikode",
          "degree": "Professional Certificate Programme, Advanced Business Management",
          "graduated": "Dec 2024",
          "description": "People Management, Business Analytics for Decision Making, International Business, Financial Statement Analysis, Operations and Supply Chain Management, Entrepreneurship & Innovation"
        },
        {
          "school": "PES University, Bangalore",
          "degree": "Master of Computer Applications - MCA, Data Science",
          "graduated": "May 2020",
          "description": "Completed three academic projects successfully with one in Web Development, IoT and Machine Learning. Throughout my Masters, I received Four Distinction Awards for my academic performance."
        },
        {
          "school": "T.John College, Bangalore",
          "degree": "Bachelor of Computer Applications",
          "graduated": "May 2016",
          "description": "The course introduced me to the world of computer science with knowledge in OS, Data Structures and Web Development. Learned programming languages such as HTML, CSS, C, C++, Java, MySQL."
        }
      ],
      "work":[
        {
          "company": "Infosys",
          "title": "Associate Consultant (AI, Topaz CoE)",
          "years": "September 2024 - Present",
          "description": "Collaborating with the team as a Gen AI Developer to improve efficiency and accuracy of customer service operations through innovative solution leveraging GPT Vision and LLMs to automate the entire process, ensuring a seamless and efficient workflow using advanced Gen AI Models."
        },
        {
          "company": "Infosys",
          "title": "Senior Systems Engineer, FSDGTL-NXT",
          "years": "March 2023 - September 2024",
          "description": "Collaborating with the team as an Angular Developer helping in the Modernization of BAU Application into Angular to serve the existing purpose but with better User Experience, Feature Enhancement and Performance Improvement. Among various other screens that I had developed, there was a very complex screen that had over 26 client types. My Additional Responsibilities Include: Getting queries clarified with SMEs of the screens, fixing identified defects, RE & UI Dependency Analysis and giving various demos to clients. I was also part of FSDGTL Exploration Pod where we focused on building our own text comprehension and question-answering services using NLP for internal purposes over a period of 3 months as part of R&D."
        },
        {
          "company": "Infosys",
          "title": "Systems Engineer, FSDGTL-NXT",
          "years": "June 2022 – March 2023",
          "description": "Collaborating with the team as UI Developer to develop Web Apps using Angular."
        },
        {
          "company": "Augmento Labs Pvt Ltd",
          "title": "Associate Software Engineer",
          "years": "August 2020 – May 2022",
          "description": "Augmento Labs is a next-gen fast-growing startup software services organization that specializes in providing unique scalable solutions with cost to value advantages that are driven by innovation. Collaborated with the team as UI Developer for Honeywell to develop and deploy Web Applications using various tech stacks in which I am majorly responsible for front-end development using React.js and TypeScript. I have also developed APIs using ASP.NET Core Web API and Node.js. My additional responsibilities were: Fixing identified bugs, explaining the project workflow, giving demos to clients and deploying the application to Dev, QA and Staging Environments. Followed Agile Software Development Methodology for code reviews and production processes. Mentored interns on various front-end and back-end technologies like React.js, TypeScript and ASP.NET Core Web API. Supervised a team of 5 on creating an internal project called RMS for my company. Single-handedly managed full-stack development and Data Analytics Integration. I was also part of React Interview Panel for the Screening Round."
        },
        {
          "company": "Nokia",
          "title": "Student Trainee",
          "years": "January 2020 - July 2020",
          "description": "I worked on LTE L2, LTE L3 and OAM Logs to analyze the mobile network load on the servers. Generated Sub Function, Log Level, Actual Log Print and Number of Occurrences from the log files and generated report. Developed an application using Python 3 and their supporting libraries like Numpy, Pandas etc to automate the generation of web reports with Femto serial number, From Date/Time, To Date/Time as input from Log machine."
        }
      ],
      "skills":[
        {
          "name": "Python (Data Science, Gen AI)",
          "level": "90%"
        },
        {
          "name": "Angular",
          "level": "50%"
        },
        {
          "name": "React.js",
          "level": "70%"
        },
        {
          "name": "Redux",
          "level": "70%"
        },
        {
          "name": "Node.js",
          "level": "70%"
        },
        {
          "name": "MongoDB",
          "level": "50%"
        },
        {
          "name": "Express.js",
          "level": "70%"
        },
        {
          "name": "TypeScript",
          "level": "70%"
        },
        {
          "name": ".NET",
          "level": "50%"
        },
        {
          "name": "MySQL",
          "level": "60%"
        },
        {
          "name": "Git",
          "level": "90%"
        },
        {
          "name": "Machine Learning/Data Science",
          "level": "90%"
        },
        {
          "name": "DevOps",
          "level": "70%"
        },
        {
          "name": "IoT",
          "level": "60%"
        },
        {
          "name": "Cloud Computing",
          "level": "60%"
        }
      ]
    },
    "portfolio":{
      "projects": [
        {
          "title": "Simple Weather App",
          "category": "A simple weather app that allows you to get current weather forecast based on the city the user enters.",
          "image": "simple-weather-app.jpg",
          "url": "https://vijaykumarrpai.github.io/simple-weather-app/"
        },
        {
          "title": "Caption Generator",
          "category": "Caption Generator is a Machine Learning Application that identifies the action portrayed in the given image. The generated caption will describe about the image that will say what kind of actions is taking place in it. This project involves computer vision and natural language processing concepts to recognize the context of an image and describe them in a natural language like English.",
          "image": "caption-generator.jpg",
          "url": "https://github.com/vijaykumarrpai/Caption-Generator"
        },
        {
          "title": "Bulk Email Aggregator",
          "category": "Bulk Email Aggregator is a web application that is used to provide a paid service to the end user who is CRM. This will enable them to send bulk emails for collecting feedback of their own electronic products once they do payment through the Stripe payment gateway. With the use of Google OAuth authentication, we have enhanced the authentication in the app.",
          "image": "bulk-email-aggregator.jpg",
          "url": "https://github.com/vijaykumarrpai/bulk-email-aggregator"
        },
        {
          "title": "Alligator",
          "category": "An IOT Project developed to monitor hostile activities in the militarized zone. As soon as the PIR sensor detects some motion, it activates the camera and starts monitoring the environment. If the activity seems to be suspicious, the camera captures the image and stores it onto the cloud for future investigation. Simultaneously it will alert the authorities to take necessary actions.",
          "image": "alligator.jpg"
        },
        {
          "title": "Optimizing Courier Delivery System",
          "category": "A full stack web application that can be used by delivery executives to get optimized route among list of addresses. Developed important features like admin panel, agent panel with integrated Google Maps.",
          "image":"optimizing-courier-delivery-system.jpg",
          "url": "https://github.com/vijaykumarrpai/courier-system"
        }
      ]
    },
    "accolades":{
      "accolades":[
        {
          "text": "INSTA AWARDS for thanking my effort and for going extra mile in terms of delivering the complex work assigned. We are in awe with the kind of difference you and some of your colleagues are bringing in positive way and sure team will look up to me from Infosys for February 2023."
        },
        {
          "text": "4 Time Infosys (FSDGTL-NXT) Digital Munch Series Quiz Winner for FY 2023."
        },
        {
          "text": "STARS OF DIGITAL AWARD for delivering highly complex screens after getting queries clarified with SME of the screens and for showing great attitude in delivering these screens from Infosys for the Month of November 2022."
        },
        {
          "text": "SPOT AWARD for On-Time Completion of Tasks and Supporting the Team Members from Augmento Labs Pvt Ltd for March 2022."
        },
        {
          "text": "SPOT AWARD for Outstanding Work from Augmento Labs Pvt Ltd for March 2021."
        },
        {
          "text": "Four Distinction Awards from PES University for good performance in academics."
        }
      ]
    }
  }
  